In [8]:
import pyodbc
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=LAPTOP-S1V0PRKL;'
                      'Database=PythonTest;'
                      'Trusted_Connection=yes;')
 
cursor1 = conn.cursor()
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (286,148,203)   
                 
                 """
cursor1.execute(sql_command)

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))
(286, '114 Tryon Rd APT 5', 2018, 8, Decimal('132.83'), Decimal('8.99'))
(286, '103 Tryon Rd APT 1', 2017, 12, Decimal('317.79'), Decimal('7.99'))
(286, '109 Tryon Rd APT 6', 2018, 9, Decimal('272.32'), Decimal('5.99'))

In [9]:
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)   
                 
                 """
cursor1.execute(sql_command,(286,148,203))

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))
(286, '114 Tryon Rd APT 5', 2018, 8, Decimal('132.83'), Decimal('8.99'))
(286, '103 Tryon Rd APT 1', 2017, 12, Decimal('317.79'), Decimal('7.99'))
(286, '109 Tryon Rd APT 6', 2018, 9, Decimal('272.32'), Decimal('5.99'))

In [12]:
account_list = (286,148,203)
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)   
                 
                 """
cursor1.execute(sql_command,account_list)

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))
(286, '114 Tryon Rd APT 5', 2018, 8, Decimal('132.83'), Decimal('8.99'))
(286, '103 Tryon Rd APT 1', 2017, 12, Decimal('317.79'), Decimal('7.99'))
(286, '109 Tryon Rd APT 6', 2018, 9, Decimal('272.32'), Decimal('5.99'))

In [13]:
account_list = (286,148,203)
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')
sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and address in (?,?,?)
                 
                 """
cursor1.execute(sql_command,account_list+address_list)

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))

In [14]:
account_list = (286,148,203)
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')

all_list = account_list + address_list


sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and address in (?,?,?)
                 
                 """
cursor1.execute(sql_command,all_list)

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))

In [17]:
account_list = (286,148,203)
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and address in (%s)
                 
                 """%('?,?,?', '?,?,?')
cursor1.execute(sql_command,account_list + address_list)

for row in cursor1:
    print(row)

(286, '100 Tryon Rd APT 1', 2017, 4, Decimal('287.88'), Decimal('4.99'))
(148, '101 Tryon Rd APT 5', 2018, 8, Decimal('75.78'), Decimal('6.99'))
(203, '102 Tryon Rd APT 1', 2018, 10, Decimal('216.56'), Decimal('7.99'))

In [18]:
print(len(account_list))

3

In [20]:
join_string =','.join('abc'*5)
print (join_string)

a,b,c,a,b,c,a,b,c,a,b,c,a,b,c

In [22]:
join_string =','.join("""abc"""*5)
print (join_string)

a,b,c,a,b,c,a,b,c,a,b,c,a,b,c

In [24]:
join_string =','.join('?'*len(account_list))
print (join_string)

?,?,?

In [ ]:
account_list = (286,148,203)
address_list = ('100 Tryon Rd APT 1', '101 Tryon Rd APT 5', '102 Tryon Rd APT 1')

sql_command = """SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (%s)
                 and address in (%s)
                 
"""%(','.join('?' * len(account_list)), ','.join('?' * len(address_list)))


cursor1.execute(sql_command,account_list + address_list)

for row in cursor1:
    print(row)

In [25]:
print(sql_command)

SELECT * FROM  [TEST1].[order_table]
                 WHERE account_id in (?,?,?)
                 and address in (?,?,?)